NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/RM21Z000F1024IM32.svd
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB11</name>
                  <description>Port B, Pin11</description>
                  <value>155</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB12</name>
                  <description>Port B, Pin12</description>
                  <value>156</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB13</name>
                  <description>Port B, Pin13</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB14</name>
                  <description>Port B, Pin14</description>
                  <value>158</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB15</name>
                  <description>Port B, Pin15</description>
                  <value>159</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC0</name>
                  <description>Port C, Pin0</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC1</name>
                  <description>Port C, Pin1</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC2</name>
                  <description>Port C, Pin2</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC3</name>
                  <description>Port C, Pin3</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC4</name>
                  <description>Port C, Pin4</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC5</name>
                  <description>Port C, Pin5</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC6</name>
                  <description>Port C, Pin6</description>
                  <value>166</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC7</name>
                  <description>Port C, Pin7</description>
                  <value>167</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC8</name>
                  <description>Port C, Pin8</description>
                  <value>168</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC9</name>
                  <description>Port C, Pin9</description>
                  <value>169</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC10</name>
                  <description>Port C, Pin10</description>
                  <value>170</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC11</name>
                  <description>Port C, Pin11</description>
                  <value>171</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC12</name>
                  <description>Port C, Pin12</description>
                  <value>172</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC13</name>
                  <description>Port C, Pin13</description>
                  <value>173</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC14</name>
                  <description>Port C, Pin14</description>
                  <value>174</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC15</name>
                  <description>Port C, Pin15</description>
                  <value>175</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD0</name>
                  <description>Port D, Pin0</description>
                  <value>176</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD1</name>
                  <description>Port D, Pin1</description>
                  <value>177</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD2</name>
                  <description>Port D, Pin2</description>
                  <value>178</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD3</name>
                  <description>Port D, Pin3</description>
                  <value>179</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD4</name>
                  <description>Port D, Pin4</description>
                  <value>180</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD5</name>
                  <description>Port D, Pin5</description>
                  <value>181</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD6</name>
                  <description>Port D, Pin6</description>
                  <value>182</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD7</name>
                  <description>Port D, Pin7</description>
                  <value>183</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD8</name>
                  <description>Port D, Pin8</description>
                  <value>184</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD9</name>
                  <description>Port D, Pin9</description>
                  <value>185</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD10</name>
                  <description>Port D, Pin10</description>
                  <value>186</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD11</name>
                  <description>Port D, Pin11</description>
                  <value>187</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD12</name>
                  <description>Port D, Pin12</description>
                  <value>188</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD13</name>
                  <description>Port D, Pin13</description>
                  <value>189</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD14</name>
                  <description>Port D, Pin14</description>
                  <value>190</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD15</name>
                  <description>Port D, Pin15</description>
                  <value>191</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFDIV</name>
              <description>VREF division</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSRESSEL</name>
              <description>Capacitive Sense Mode Internal Resistor </description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0</name>
                  <description>Internal capacitive sense resistor value 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1</name>
                  <description>Internal capacitive sense resistor value 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2</name>
                  <description>Internal capacitive sense resistor value 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3</name>
                  <description>Internal capacitive sense resistor value 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES4</name>
                  <description>Internal capacitive sense resistor value 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES5</name>
                  <description>Internal capacitive sense resistor value 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES6</name>
                  <description>Internal capacitive sense resistor value 6</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001D</resetMask>
          <fields>
            <field>
              <name>ACMPOUT</name>
              <description>Analog Comparator Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMPRDY</name>
              <description>Analog Comparator Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUTCONFLICT</name>
              <description>INPUT conflict</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORTALLOCERR</name>
              <description>Port allocation error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>RISE</name>
              <description>Rising Edge Triggered Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALL</name>
              <description>Falling Edge Triggered Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMPRDY</name>
              <description>ACMP ready Interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTCONFLICT</name>
              <description>Input conflict</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTALLOCERR</name>
              <description>Port allocation error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>RISE</name>
              <description>Rising edge interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALL</name>
              <description>Falling edge interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMPRDY</name>
              <description>ACMP ready interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTCONFLICT</name>
              <description>Input conflict interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTALLOCERR</name>
              <description>Port allocation error interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>INPUTCTRL</name>
              <description>Syncbusy for INPUTCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
